expense_tracker/jmeter/report/report_k8s_baseline_20251104_141646/statistics.json
{
  "GET Home" : {
    "transaction" : "GET Home",
    "sampleCount" : 500,
    "errorCount" : 500,
    "errorPct" : 100.0,
    "meanResTime" : 0.08399999999999996,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 14.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 1.990000000000009,
    "throughput" : 46.97482149567832,
    "receivedKBytesPerSec" : 50.82822482149568,
    "sentKBytesPerSec" : 0.0
  },
  "POST Login" : {
    "transaction" : "POST Login",
    "sampleCount" : 500,
    "errorCount" : 500,
    "errorPct" : 100.0,
    "meanResTime" : 0.5800000000000005,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 40.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 16.980000000000018,
    "throughput" : 46.992481203007515,
    "receivedKBytesPerSec" : 51.1226797462406,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2000,
    "errorCount" : 2000,
    "errorPct" : 100.0,
    "meanResTime" : 0.2810000000000011,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 40.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 6.980000000000018,
    "throughput" : 187.61726078799248,
    "receivedKBytesPerSec" : 203.8780341228893,
    "sentKBytesPerSec" : 0.0
  },
  "GET Expenses" : {
    "transaction" : "GET Expenses",
    "sampleCount" : 500,
    "errorCount" : 500,
    "errorPct" : 100.0,
    "meanResTime" : 0.0659999999999999,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 1.0,
    "throughput" : 47.05439488048184,
    "receivedKBytesPerSec" : 51.3278897280256,
    "sentKBytesPerSec" : 0.0
  },
  "POST Add Expense" : {
    "transaction" : "POST Add Expense",
    "sampleCount" : 500,
    "errorCount" : 500,
    "errorPct" : 100.0,
    "meanResTime" : 0.3940000000000004,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 39.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 9.990000000000009,
    "throughput" : 47.05439488048184,
    "receivedKBytesPerSec" : 51.098131940523245,
    "sentKBytesPerSec" : 0.0
  }
}