expense_tracker/jmeter/report/report_swarm_spike_20251106_021433/statistics.json
{
  "GET Add Expense Page" : {
    "transaction" : "GET Add Expense Page",
    "sampleCount" : 473,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 16661.376321353055,
    "medianResTime" : 16860.0,
    "minResTime" : 1160.0,
    "maxResTime" : 37050.0,
    "pct1ResTime" : 27959.6,
    "pct2ResTime" : 31943.39999999999,
    "pct3ResTime" : 35959.38,
    "throughput" : 3.383066073497647,
    "receivedKBytesPerSec" : 13.548783171302588,
    "sentKBytesPerSec" : 1.0282494734075271
  },
  "GET Login Page" : {
    "transaction" : "GET Login Page",
    "sampleCount" : 600,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8231.44166666667,
    "medianResTime" : 8587.5,
    "minResTime" : 22.0,
    "maxResTime" : 23913.0,
    "pct1ResTime" : 14263.599999999991,
    "pct2ResTime" : 16278.949999999972,
    "pct3ResTime" : 20914.24,
    "throughput" : 4.235493434985175,
    "receivedKBytesPerSec" : 6.986082433290979,
    "sentKBytesPerSec" : 1.0285410489905407
  },
  "POST Login" : {
    "transaction" : "POST Login",
    "sampleCount" : 562,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 16613.316725978646,
    "medianResTime" : 16241.5,
    "minResTime" : 1761.0,
    "maxResTime" : 38098.0,
    "pct1ResTime" : 27712.999999999996,
    "pct2ResTime" : 31536.250000000004,
    "pct3ResTime" : 36667.26,
    "throughput" : 3.9556015400099946,
    "receivedKBytesPerSec" : 7.854441935534957,
    "sentKBytesPerSec" : 1.8207693935330842
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2048,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 12715.253906249987,
    "medianResTime" : 9766.5,
    "minResTime" : 22.0,
    "maxResTime" : 38098.0,
    "pct1ResTime" : 25543.100000000002,
    "pct2ResTime" : 29670.649999999998,
    "pct3ResTime" : 35987.63,
    "throughput" : 14.402351633977736,
    "receivedKBytesPerSec" : 40.04417884443632,
    "sentKBytesPerSec" : 5.398519416451592
  },
  "POST Add Expense" : {
    "transaction" : "POST Add Expense",
    "sampleCount" : 413,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9405.472154963682,
    "medianResTime" : 4961.0,
    "minResTime" : 1144.0,
    "maxResTime" : 37079.0,
    "pct1ResTime" : 25859.0,
    "pct2ResTime" : 34960.89999999996,
    "pct3ResTime" : 37039.88,
    "throughput" : 3.17450556883604,
    "receivedKBytesPerSec" : 13.023533100273639,
    "sentKBytesPerSec" : 1.6872367389449574
  }
}